In [1]:
import pandas as pd
import numpy as np

# Series

In [2]:
temperature = [22, 28, 19, 24, 30]
temp_series = pd.Series(temperature)
temp_series

0    22
1    28
2    19
3    24
4    30
dtype: int64

In [3]:
days = ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday']
temp_series = pd.Series(temperature, index=days)
temp_series

Monday       22
Tuesday      28
Wednesday    19
Thursday     24
Friday       30
dtype: int64

## Fruit series

In [5]:
fruit_counts = {'Apple': 10, 'Bananas': 15, 'Cherries': 17}
fruit_series = pd.Series(fruit_counts)
fruit_series

Apple       10
Bananas     15
Cherries    17
dtype: int64

In [6]:
random_numbers = np.random.random(5)
random_series = pd.Series(random_numbers)
random_series

0    0.006985
1    0.276157
2    0.767892
3    0.972043
4    0.247096
dtype: float64

# DataFrame

In [9]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'Country': ['USA', 'UK', 'Canada', 'Australia']
}

In [10]:
df = pd.DataFrame(data)
df

      Name  Age    Country
0    Alice   25        USA
1      Bob   30         UK
2  Charlie   35     Canada
3    David   40  Australia

In [11]:
data2 = [
    { 'Name': 'Emma', 'Age': 29, 'Country': 'USA'},
    { 'Name': 'Liam', 'Age': 32, 'Country': 'UK'},
    { 'Name': 'Olivia', 'Age': 27, 'Country': 'Canada'},
]
df2 = pd.DataFrame(data2)
df2

     Name  Age Country
0    Emma   29     USA
1    Liam   32      UK
2  Olivia   27  Canada

In [14]:
array_data = np.array([
    [5, 3, 1, 2],
    [4, 3, 1, 2],
    [6, 3, 5, 2],
])
columns = ['SepaLength', 'SepaWidth', 'PetalLength', 'PetalWdith']

df = pd.DataFrame(array_data, columns=columns)
df

   SepaLength  SepaWidth  PetalLength  PetalWdith
0           5          3            1           2
1           4          3            1           2
2           6          3            5           2

In [15]:
apple_stock = pd.Series([150, 153, 155], index=['2025-01-01', '2025-01-02', '2025-01-03'])
google_stock = pd.Series([2800, 2825, 2830], index=['2025-01-01', '2025-01-02', '2025-01-03'])

stocks_df = pd.DataFrame({'Apple': apple_stock, 'Google': google_stock})
stocks_df

            Apple  Google
2025-01-01    150    2800
2025-01-02    153    2825
2025-01-03    155    2830

## Add a column of data

In [17]:
stocks_df['MarketCap'] = [25000000, 26000000, 27000000]
stocks_df

            Apple  Google  MarketCap
2025-01-01    150    2800   25000000
2025-01-02    153    2825   26000000
2025-01-03    155    2830   27000000

## Remove a column of data

In [19]:
stocks_df = stocks_df.drop('MarketCap', axis=1)
stocks_df

            Apple  Google
2025-01-01    150    2800
2025-01-02    153    2825
2025-01-03    155    2830

## Access a column

In [20]:
stocks_df['Apple']

2025-01-01    150
2025-01-02    153
2025-01-03    155
Name: Apple, dtype: int64

## Access a row using loc and iloc

In [22]:
row = stocks_df.loc['2025-01-02']
row

Apple      153
Google    2825
Name: 2025-01-02, dtype: int64

In [23]:
row = stocks_df.iloc[0]
row

Apple      150
Google    2800
Name: 2025-01-01, dtype: int64